---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetEnumerator
source: html/f4f0511f-3ff8-d69f-a457-af5be5b91679.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<RebarContainerItem> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.